---
kind: property
id: P:Autodesk.Revit.DB.Structure.Rebar.TotalLength
zh: 钢筋、配筋
source: html/69f129e5-5510-53ea-95be-ac0f4dcb2a4f.htm
---
# Autodesk.Revit.DB.Structure.Rebar.TotalLength Property

**中文**: 钢筋、配筋

The length of an individual bar multiplied by Quantity.

## Syntax (C#)
```csharp
public double TotalLength { get; }
```